# Задача 3. В двумерном массиве хранятся средние дневные температуры
# с мая по сентябрь за прошлый год. Каждому месяцу соответствует своя 
# строка. Определите самый жаркий и самый холодный 7-дневный промежуток 
# этого периода. Выведите его даты.

import random
import numpy as np


arr = np.array([[7, 7, 9, 9, 19, 10, 9, 8, 15, 18, 16, 11, 10, 12, 9, 10, 14, 13, 12, 14, 9, 12, 14, 13, 11, 16, 15, 14, 18, 17, 14], [12, 13, 12, 11, 15, 17, 20, 19, 12, 13, 16, 18, 21, 22, 22, 23, 20, 17, 18, 17, 21, 22, 16, 15, 15, 20, 22, 23, 25, 26], [26, 24, 25, 23, 25, 28, 25, 24, 23, 23, 22, 21, 23, 24, 23, 24, 22, 20, 20, 19, 22, 24, 23, 25, 28, 27, 26, 25, 22, 25, 25], [24, 26, 24, 22, 23, 24, 22, 23, 25, 20, 25, 23, 24, 22, 20, 21, 24, 17, 15, 17, 17, 14, 17, 18, 15, 14, 15, 16, 16, 18, 16], [15, 16, 20, 21, 17, 15, 13, 14, 15, 18, 18, 19, 15, 10, 14, 15, 15, 15, 16, 8, 6, 7, 13, 15, 12, 13, 12, 13, 12, 11]])
days = [[len(arr[0])], [len(arr[1])]]
dict = {'Май': '31', 'Июнь' : '30', 'Июль' : '31', 'Август' : '31', 'Сентябрь' : '30' }

result = []
for row in arr:
    for el in row:
        result.append(el)
min = 0
max = 0
daysMin = 1
daysMax = 1
for i in range(len(result[:-5])):
    n = sum(result[i:i+7])
    if n < min:
        min = n
        daysMin = i
    if n > max:
        max = n
        daysMax = i

a = 0
month = ' '

for k, v in dict.items():
    a = a + int(v)
    month = k
    if daysMax < a:
        b = a -int(v)
        dayMax1 = daysMax - b 
        print(f'Максимальные температуры в дни с {dayMax1} {month} по {dayMax1+6} {month}')
        break
a = 0
month = ' '

for k, v in dict.items():
    a = a + int(v)
    month = k
    if daysMin < a:
        b = a -int(v)
        dayMin1 = daysMin - b 
        print(f'Минимальные температуры в дни с {dayMin1} {month} по {dayMin1+6} {month}')
        break

